Revit 2027 API
ParameterTypeId.ViewAssociatedAssemblyInstanceId Property
 "Associated Assembly Instance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewAssociatedAssemblyInstanceId { get; }
Public Shared ReadOnly Property ViewAssociatedAssemblyInstanceId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewAssociatedAssemblyInstanceId {
	ForgeTypeId^ get ();
}
static member ViewAssociatedAssemblyInstanceId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace